# Dataframes Part 1

In [54]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
np.random.seed(101)

In [3]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [4]:
df=pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'], columns=['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [6]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) # in sequence no need to  provode data,index,columns

In [7]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [8]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [9]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [10]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [11]:
df['W']

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [12]:
type(df['W'])

pandas.core.series.Series

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.W    # same like df['W'] , like SQL tablename . coloumn name

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [15]:
df['W']

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [16]:
df[['W','X']]

    W   X
A   0   1
B   4   5
C   8   9
D  12  13
E  16  17

In [17]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [43]:
df['NewCol']=df['W']+df['X']

In [44]:
df

    W   X   Y   Z  NewCol
A   0   1   2   3       1
B   4   5   6   7       9
C   8   9  10  11      17
D  12  13  14  15      25
E  16  17  18  19      33

In [45]:
df

    W   X   Y   Z  NewCol
A   0   1   2   3       1
B   4   5   6   7       9
C   8   9  10  11      17
D  12  13  14  15      25
E  16  17  18  19      33

In [46]:
df.drop('A',axis=0)  #to remove Row use axis=0 , This will not remove PERMANENTLY

    W   X   Y   Z  NewCol
B   4   5   6   7       9
C   8   9  10  11      17
D  12  13  14  15      25
E  16  17  18  19      33

In [47]:
df

    W   X   Y   Z  NewCol
A   0   1   2   3       1
B   4   5   6   7       9
C   8   9  10  11      17
D  12  13  14  15      25
E  16  17  18  19      33

In [48]:
df.drop('A')   # axis=0 is default , so while deleting row no need to mention Axis 0  ; axis 0  for row

    W   X   Y   Z  NewCol
B   4   5   6   7       9
C   8   9  10  11      17
D  12  13  14  15      25
E  16  17  18  19      33

In [49]:
df

    W   X   Y   Z  NewCol
A   0   1   2   3       1
B   4   5   6   7       9
C   8   9  10  11      17
D  12  13  14  15      25
E  16  17  18  19      33

In [50]:
df.drop('NewCol',axis=1)  ## to remove column use axis=1 , This will not remove PERMANENTLY   axis 1  for row

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [51]:
df

    W   X   Y   Z  NewCol
A   0   1   2   3       1
B   4   5   6   7       9
C   8   9  10  11      17
D  12  13  14  15      25
E  16  17  18  19      33

In [52]:
df.drop('NewCol',axis=1, inplace=True)  ##to remove column PERMANENTLY use inplace=True

In [53]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [29]:
df.shape

(5, 4)

In [30]:
type(df.shape)

tuple

In [31]:
df.shape

(5, 4)

In [32]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [33]:
df.loc['A']  # row series

W    0
X    1
Y    2
Z    3
Name: A, dtype: int32

In [34]:
df.loc['C']

W     8
X     9
Y    10
Z    11
Name: C, dtype: int32

In [35]:
df.iloc[2]   # Index based

W     8
X     9
Y    10
Z    11
Name: C, dtype: int32

In [36]:
df.loc['B','Y']

6

In [37]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [38]:
df.loc[['A','B'],['W','Y']]

   W  Y
A  0  2
B  4  6